AgentosUA/psoc6-labs/lab12/lab12/lab12.cydsn/Generated_Source/PSoC6/pdl/dfu/cy_dfu.h
#include "cy_syslib.h"


#ifdef __cplusplus
extern "C"{
#endif

/**
* \addtogroup group_dfu_macro
* \{
*/



/** The DFU SDK major version */
#define CY_DFU_SDK_VERSION_MAJOR       3
/** The DFU SDK minor version */
#define CY_DFU_SDK_VERSION_MINOR       0

/**
* \defgroup group_dfu_macro_state DFU State
* \{
* The state of updating. \n
* This is a set of values that the DFU state variable can hold. \n
* When Cy_DFU_Continue() and Cy_DFU_Complete() return, the state parameter
* indicates whether the update has finished successfully or what is the unsuccessful
* state.
*/
#define CY_DFU_STATE_NONE          (0u) /**< Updating has not yet started, no Enter packet received */
#define CY_DFU_STATE_UPDATING      (1u) /**< Updating is in process             */
#define CY_DFU_STATE_FINISHED      (2u) /**< Updating has finished successfully */
#define CY_DFU_STATE_FAILED        (3u) /**< Updating has finished with error   */
/** \} group_dfu_macro_state */

#define CY_DFU_PACKET_MIN_SIZE     (0x07u) /**< Smallest valid DFU packet size */

/**
* \defgroup group_dfu_macro_commands DFU Commands
* \{
*/
#define CY_DFU_CMD_ENTER           (0x38u) /**< DFU command: Enter DFU           */
#define CY_DFU_CMD_EXIT            (0x3Bu) /**< DFU command: Exit DFU            */
#define CY_DFU_CMD_PROGRAM_DATA    (0x49u) /**< DFU command: Program Data               */
#define CY_DFU_CMD_VERIFY_DATA     (0x4Au) /**< DFU command: Verify Data                */
#define CY_DFU_CMD_ERASE_DATA      (0x44u) /**< DFU command: Erase Data                 */
#define CY_DFU_CMD_VERIFY_APP      (0x31u) /**< DFU command: Verify Application         */
#define CY_DFU_CMD_SEND_DATA       (0x37u) /**< DFU command: Send Data                  */
#define CY_DFU_CMD_SEND_DATA_WR    (0x47u) /**< DFU command: Send Data without Response */
#define CY_DFU_CMD_SYNC            (0x35u) /**< DFU command: Sync DFU            */
#define CY_DFU_CMD_SET_APP_META    (0x4Cu) /**< DFU command: Set Application Metadata   */
#define CY_DFU_CMD_GET_METADATA    (0x3Cu) /**< DFU command: Get Metadata               */
#define CY_DFU_CMD_SET_EIVECTOR    (0x4Du) /**< DFU command: Set EI Vector              */

/** \} group_dfu_macro_commands */

/**
* \defgroup group_dfu_macro_ioctl Read/Write Data IO Control Values
* \{
* The values of the ctl parameter to \ref Cy_DFU_ReadData() and \ref Cy_DFU_WriteData() functions.
* - Bit 0:
*   * 0, Normal read or write operations.
*   * 1, Erase a memory page for write operations.
*        Compare a memory page with the data in the buffer for read operation.
* - Bit 1:
*   * 0, Read or write with raw data
*   * 1, Data received from/to be sent to the DFU Host.
*        May require encryption/decryption or any other special treatment.
         E.g. read/write a data from/to an address with an offset.
* - Bit 2: Reserved.
* - Bit 3: Reserved.
* - Bit 4 - 31: Unused in DFU SDK. Up to the user to specify it.
*/

#define CY_DFU_IOCTL_READ          (0x00u) /**< Read data into buffer                         */
#define CY_DFU_IOCTL_COMPARE       (0x01u) /**< Compare read data with the data in the buffer */

#define CY_DFU_IOCTL_WRITE         (0x00u) /**< Write buffer to communication */
#define CY_DFU_IOCTL_ERASE         (0x01u) /**< Erase memory page             */

#define CY_DFU_IOCTL_BHP           (0x02u) /**< Data from/to DFU Host. It may require decryption */

/** \} group_dfu_macro_ioctl */

/**
* \defgroup group_dfu_macro_response_size Response Size
* \{
*/

#define CY_DFU_RSP_SIZE_0          (0u)    /**< Data size for most DFU commands responses */
#define CY_DFU_RSP_SIZE_VERIFY_APP (1u)    /**< Data size for 'Verify Application' DFU command response */

/** \} group_dfu_macro_response_size */

/** DFU SDK PDL ID */
#define CY_DFU_ID                  CY_PDL_DRV_ID(0x06u)


/**
* \defgroup group_dfu_macro_app_type Application types
* \{
* Used to define what application format is expected.
*/
#define CY_DFU_BASIC_APP           (0u)    /**< Application format for non-secure applications */
#define CY_DFU_CYPRESS_APP         (1u)    /**< Cypress Standard User Application format */
#define CY_DFU_SIMPLIFIED_APP      (2u)    /**< Simplified User Application Object format */
/** \} group_dfu_macro_app_type */

/**
* \defgroup group_dfu_macro_ver_type Types of secure application verification
* \{
* Used to define what type of secure application verification is expected.
*/
#define CY_DFU_VERIFY_FAST         (0u)    /**< Verification includes only application check*/
#define CY_DFU_VERIFY_FULL         (1u)    /**< Verification includes application, key, and TOC checks */
/** \} group_dfu_macro_ver_type */

/** \} group_dfu_macro */

/**
* \addtogroup group_dfu_data_structs
* \{
*/

/** Working parameters for some DFU SDK APIs. */
typedef struct
{
    /**
    * The pointer to a buffer that keeps data to read or write to an NVM.
    * It is required to be 4-byte aligned.
    */
    uint8_t  *dataBuffer;
    uint32_t  dataOffset;   /**< Offset within \c dataBuffer to put next chunk of data */
    /**
    * The pointer to a buffer that keeps packets sent and received with the Transport API.
    * It is required to be 4-byte aligned.
    */
    uint8_t  *packetBuffer;
    uint32_t  timeout;      /**< The timeout value in milliseconds */
    uint32_t  appId;        /**< Set with the Set App Metadata DFU command.
                            *    Used to determine an appId of DFU image  */
    uint32_t  appVerified;  /**< Internal, flags if Verify Application is called before Exit */
    
    /**
    * The initial value to the ctl parameter for
    * \ref Cy_DFU_ReadData and \ref Cy_DFU_WriteData.
    * The DFU SDK functions call Read/Write Data functions like this: \n
    * Cy_DFU_ReadData(addr, length, CY_DFU_IOCTL_COMPARE, params).
    */
    uint32_t  initCtl;
    
#if CY_DFU_OPT_SET_EIVECTOR != 0
    /**
    * The pointer to an Encryption Initialization Vector buffer.
    * Must be 0-, 8-, or 16-byte long and 4-byte aligned.
    * This may be used in \ref Cy_DFU_ReadData and \ref Cy_DFU_WriteData
    * to encrypt or decrypt data when the CY_DFU_IOCTL_BHP flag is set in the
    * ctl parameter.
    */
    uint8_t *encryptionVector;
#endif /* CY_DFU_OPT_SET_EIVECTOR != 0 */
    
} cy_stc_dfu_params_t;

/**
* Only used inside DFU Command_Enter().
* \note A public definition because the user may want to redefine 
* the DFU packet.
*/
typedef struct
{
    uint32_t enterSiliconId;             /**< The silicon ID for a device */
    uint8_t  enterRevision;              /**< Silicon Revision for a device */
    uint8_t  enterDFUVersion[3];         /**< The DFU SDK version */
} cy_stc_dfu_enter_t;
/** \} group_dfu_data_structs */

/**
* \addtogroup group_dfu_enums
* \{
*/

/** Used to return the statuses of most DFU SDK APIs */
typedef enum
{
    /** Correct status, No error */
    CY_DFU_SUCCESS         =                                        0x00u,
    /** Verification failed */
    CY_DFU_ERROR_VERIFY    = CY_DFU_ID | CY_PDL_STATUS_ERROR | 0x02u,
    /** The length of received packet is outside of expected range */
    CY_DFU_ERROR_LENGTH    = CY_DFU_ID | CY_PDL_STATUS_ERROR | 0x03u,
    /** The data in the received packet is invalid */
    CY_DFU_ERROR_DATA      = CY_DFU_ID | CY_PDL_STATUS_ERROR | 0x04u,
    /** Command is not recognized */
    CY_DFU_ERROR_CMD       = CY_DFU_ID | CY_PDL_STATUS_ERROR | 0x05u,
    /** checksum does not match the expected value */
    CY_DFU_ERROR_CHECKSUM  = CY_DFU_ID | CY_PDL_STATUS_ERROR | 0x08u,
    /** Wrong address */
    CY_DFU_ERROR_ADDRESS   = CY_DFU_ID | CY_PDL_STATUS_ERROR | 0x0Au,
    /** Command timed out */
    CY_DFU_ERROR_TIMEOUT   = CY_DFU_ID | CY_PDL_STATUS_ERROR | 0x40u,
    /** Unknown DFU error, this shall not happen */
    CY_DFU_ERROR_UNKNOWN   = CY_DFU_ID | CY_PDL_STATUS_ERROR | 0x0Fu
} cy_en_dfu_status_t;


