AgentosUA/psoc6-labs/lab12/lab12/lab12.cydsn/Generated_Source/PSoC6/pdl/dfu/cy_dfu.h
/** \} group_dfu_enums */

/**
* \addtogroup group_dfu_globals
* \{
*/

/**
* \defgroup group_dfu_globals_external_elf_symbols External ELF file symbols
* \{
* These symbols are added to the generated ELF file. \n
* Their values are either defined in the linker script (GCC, IAR)
* or in an assembly code (MDK).
* They may be used by CyMCUElfTool as parameters for generating a CYACD2 file.
* Also, the DFU SDK APIs may user them to refer link-time known values
* to the compile time.
*/
extern uint8_t __cy_boot_metadata_addr;     /**< Metadata address           */
extern uint8_t __cy_boot_metadata_length;   /**< Metadata row size          */
extern uint8_t __cy_product_id;             /**< Product ID                 */
extern uint8_t __cy_checksum_type;          /**< Checksum Algorithm for BHP */
extern uint8_t __cy_app_id;                 /**< Current application number */
extern uint8_t __cy_app_core1_start_addr;   /**< core1 vector table address, if present */
/** \} group_dfu_globals_external_elf_symbols */

/** \} group_dfu_globals */

/**
* \addtogroup group_dfu_functions
* \{
*/

cy_en_dfu_status_t Cy_DFU_Complete(uint32_t *state, uint32_t timeout);
cy_en_dfu_status_t Cy_DFU_Init(uint32_t *state, cy_stc_dfu_params_t *params);
cy_en_dfu_status_t Cy_DFU_Continue(uint32_t *state, cy_stc_dfu_params_t *params);

void Cy_DFU_ExecuteApp(uint32_t appId);
cy_en_dfu_status_t Cy_DFU_SwitchToApp(uint32_t appId);

uint32_t Cy_DFU_DataChecksum(const uint8_t *address, uint32_t length, cy_stc_dfu_params_t *params);
cy_en_dfu_status_t Cy_DFU_ValidateMetadata(uint32_t metadataAddress, cy_stc_dfu_params_t *params);
cy_en_dfu_status_t Cy_DFU_ValidateApp(uint32_t appId, cy_stc_dfu_params_t *params);

uint32_t Cy_DFU_GetRunningApp(void);

cy_en_dfu_status_t Cy_DFU_GetAppMetadata(uint32_t appId, uint32_t *verifyAddress, uint32_t *verifySize);

#if CY_DFU_METADATA_WRITABLE != 0
    cy_en_dfu_status_t Cy_DFU_SetAppMetadata(uint32_t appId, uint32_t verifyAddress,
                                                       uint32_t verifySize, cy_stc_dfu_params_t *params);
#endif /* if CY_DFU_METADATA_WRITABLE != 0 */

cy_en_dfu_status_t Cy_DFU_CopyApp(uint32_t destAddress, uint32_t srcAddress, uint32_t length,
                                            uint32_t rowSize, cy_stc_dfu_params_t *params);

void Cy_DFU_OnResetApp0(void);

/* These 2 IO functions have to be re-implemented in the user's code */
cy_en_dfu_status_t Cy_DFU_ReadData (uint32_t address, uint32_t length, uint32_t ctl, 
                                              cy_stc_dfu_params_t *params);
cy_en_dfu_status_t Cy_DFU_WriteData(uint32_t address, uint32_t length, uint32_t ctl, 
                                              cy_stc_dfu_params_t *params);

/* These 5 communication functions have to be re-implemented in the user's code */
cy_en_dfu_status_t Cy_DFU_TransportRead (uint8_t buffer[], uint32_t size, uint32_t *count, uint32_t timeout);
cy_en_dfu_status_t Cy_DFU_TransportWrite(uint8_t buffer[], uint32_t size, uint32_t *count, uint32_t timeout);
void Cy_DFU_TransportReset(void);
void Cy_DFU_TransportStart(void);
void Cy_DFU_TransportStop(void);


/** \} group_dfu_functions */


/***************************************
*  Internal declarations
****************************************/
/** \cond INTERNAL */

#if !defined(CY_PSOC_CREATOR_USED)

    /* Should be 0 in non Creator flow */
    #define CY_DFU_SILICON_ID      (0u)
    #define CY_DFU_SILICON_REV     (0u)
#else
    #include "cy_device_headers.h" /* for CY_SILICON_ID            */
    #include <cyfitter.h>          /* for CYDEV_CHIP_REVISION_USED */

    #define CY_DFU_SILICON_ID  CY_SILICON_ID
    #define CY_DFU_SILICON_REV CYDEV_CHIP_REVISION_USED
#endif /* defined CY_DOXYGEN*/

/** \endcond*/

#ifdef __cplusplus
}
#endif

#endif /* !defined(CY_DFU_H) */


/* [] END OF FILE */
